src_doc/Documents/ЕжедневныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЕжедневныйОтчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РабочееВремяСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабочая</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НекорректнаяДлительность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказанияВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУказанияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_doc/InformationRegisters/ФактическиеТрудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФактическиеТрудозатраты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьВВыходные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьСверхурочно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйОтчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДобавления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроектнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Documents/ЕжедневныйОтчет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// УправлениеДоступом

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Ссылка, Сотрудник";
	
КонецФункции
	
// Проверяет наличие метода.
// 
Функция ЕстьМетодЗаполнитьДескрипторыОбъекта() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Заполняет переданную таблицу дескрипторов объекта.
// 
Процедура ЗаполнитьДескрипторыОбъекта(ОбъектДоступа, ТаблицаДескрипторов, ПротоколРасчетаПрав = Неопределено) Экспорт
	
	ПользовательСотрудника = Сотрудники.ПользовательСотрудника(ОбъектДоступа.Сотрудник);
	ДокументооборотПраваДоступа.ДобавитьИндивидуальныйДескриптор(
		ОбъектДоступа, 
		ТаблицаДескрипторов, 
		ПользовательСотрудника,
		Истина);
	
	Если ПротоколРасчетаПрав <> Неопределено Тогда
		ЗаписьПротокола = Новый Структура("Элемент, Описание",
			ОбъектДоступа.Сотрудник, НСтр("ru = 'Пользователь'"));
		ПротоколРасчетаПрав.Добавить(ЗаписьПротокола);
	КонецЕсли;
	
КонецПроцедуры

// Конец УправлениеДоступом

// Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Карточка
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЕжедневныйОтчет";
	КомандаПечати.Идентификатор = "ЕжедневныйОтчет";
	КомандаПечати.Представление = НСтр("ru = 'Ежедневный отчет'");
	
КонецПроцедуры

// Процедура формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЕжедневныйОтчет") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ЕжедневныйОтчет",
			НСтр("ru = 'Ежедневный отчет'"),
			ПечатьЕжедневногоОтчета(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,
			"Документ.ЕжедневныйОтчет.ПФ_MXL_ЕжедневныйОтчет");
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатную форму.
//
Функция ПечатьЕжедневногоОтчета(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЕжедневныйОтчет";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	// Получение областей макета.
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕжедневныйОтчет.ПФ_MXL_ЕжедневныйОтчет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Для Каждого Объект Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект,
			"Дата, Сотрудник, СпособУказанияВремени");
		
		ОбластьШапка.Параметры.Сотрудник = РеквизитыОбъекта.Сотрудник;
		ОбластьШапка.Параметры.Дата = Формат(РеквизитыОбъекта.Дата, "ДЛФ=D");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Работы = УчетВремениВызовСервера.ПолучитьРаботыЗаДень(РеквизитыОбъекта.Дата, РеквизитыОбъекта.Сотрудник);
		
		Если РеквизитыОбъекта.СпособУказанияВремени = Перечисления.СпособыУказанияВремени.ВремяНачала Тогда 
			Работы.Сортировать("Начало");
		Иначе
			Работы.Сортировать("ДатаДобавления");
		КонецЕсли;
		
		ДлительностьРаботСек = 0;
		
		Для Каждого Работа Из Работы Цикл
			
			Если ЗначениеЗаполнено(Работа.ЕжедневныйОтчет) 
			   И Работа.ЕжедневныйОтчет <> Объект Тогда 
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Работа = Работа.ОписаниеРаботы;
			ОбластьСтрока.Параметры.Длительность = 
				УчетВремениКлиентСервер.ЧислоВСтроку(Работа.Длительность);
			ОбластьСтрока.Параметры.ВидРабот = Работа.ВидРабот;
			ОбластьСтрока.Параметры.ПроектЗадача = 
				РаботаСПроектамиКлиентСервер.ПредставлениеПроектаЗадачи(Работа.Проект, Работа.ПроектнаяЗадача);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ДлительностьРаботСек = ДлительностьРаботСек + Работа.Длительность;
			
		КонецЦикла;
	
		ОбластьПодвал.Параметры.ВсегоЗаДень = 
			НСтр("ru = 'Всего за день'") + " " + 
			УчетВремениКлиентСервер.ЧислоВСтроку(ДлительностьРаботСек, "0");
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Конец Печать

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
КонецПроцедуры

Процедура ЗаполнитьРеквизитДлительностьРабочая(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Истина;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРабот.Ссылка КАК ВидРабот
		|ПОМЕСТИТЬ ВидыРабот
		|ИЗ
		|	Справочник.ВидыРабот КАК ВидыРабот
		|ГДЕ
		|	ВидыРабот.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.Рабочее)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРабот.ВидРабот КАК ВидРабот
		|ИЗ
		|	ВидыРабот КАК ВидыРабот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	Документ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЕжедневныйОтчет КАК Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФактическиеТрудозатраты КАК РаботыДокументов
		|		ПО Документ.Ссылка = РаботыДокументов.ЕжедневныйОтчет
		|			И (РаботыДокументов.ВидРабот В
		|				(ВЫБРАТЬ
		|					ВидыРабот.ВидРабот
		|				ИЗ
		|					ВидыРабот))
		|			И (РаботыДокументов.Длительность <> 0)
		|ГДЕ
		|	Документ.ДлительностьРабочая = """"
		|	И НЕ РаботыДокументов.ЕжедневныйОтчет ЕСТЬ NULL");
	Результат = Запрос.ВыполнитьПакет();
	ВидыРабот = Результат[1].Выгрузить().ВыгрузитьКолонку("ВидРабот");
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Параметры.ОбработкаЗавершена = Ложь;
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("Документ.ЕжедневныйОтчет");
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка.Заблокировать();
			
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Работы = УчетВремениВызовСервера.ПолучитьРаботыЗаДень(Документ.Дата, 
				Сотрудники.ЛюбойПользовательСотрудника(Документ.Сотрудник));
			ДлительностьРабочегоВремениСек = 0;
			Для Каждого Работа Из Работы Цикл
				Если ЗначениеЗаполнено(Работа.ЕжедневныйОтчет) 
					И Работа.ЕжедневныйОтчет <> Выборка.Ссылка Тогда 
					Продолжить;
				КонецЕсли;
				Если ВидыРабот.Найти(Работа.ВидРабот) <> Неопределено Тогда
					ДлительностьРабочегоВремениСек = ДлительностьРабочегоВремениСек + Работа.Длительность;
				КонецЕсли;
			КонецЦикла;
			Документ.ДлительностьРабочая = УчетВремениКлиентСервер.ЧислоВСтроку(ДлительностьРабочегоВремениСек);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Документ);
			
			Движения = РегистрыНакопления.РабочееВремяСотрудников.СоздатьНаборЗаписей();
			Движения.Отбор.Регистратор.Установить(Выборка.Ссылка);
			Движения.Прочитать();
			
			Для Каждого Движение Из Движения Цикл
				Если ВидыРабот.Найти(Движение.ВидРабот) <> Неопределено Тогда
					Движение.ДлительностьРабочая = Движение.ДлительностьВсего;
				Иначе
					Движение.ДлительностьРабочая = 0;
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Движения);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
